SrvrtsRefDOCMGRDEMO/src/InformationRegisters/МП_ИзмененныеСостоянияПриглашенийНаМероприятия/МП_ИзмененныеСостоянияПриглашенийНаМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ИзмененныеСостоянияПриглашенийНаМероприятия</name>
  <dimensions>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SrvrtsRefDOCMGRDEMO/src/InformationRegisters/МП_ИзмененныеСостоянияПриглашенийНаМероприятия/ManagerModule.bsl
Процедура ДобавитьЗапись(Пользователь, Мероприятие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.Мероприятие.Установить(Мероприятие);
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	
	МЗ = НЗ.Добавить();
	МЗ.Пользователь = Пользователь;
	МЗ.Мероприятие = Мероприятие;
	МЗ.ОтметкаВремени = ОтметкиВремени.Текущая();
	НЗ.Записать();
	
КонецПроцедуры
